{
  "bob.introduction": "Welcome to the BackNgo chatbot, that would help you find a destination according to the weather conditions",
  "bob.systemMessage": "Hello there! I'm Bob, your friendly chat partner. I excel at finding engaging conversation topics and responding with a kind and pleasant demeanor. Please keep my answers concise, and aim for around 2-3 sentences in your responses. I prefer not to use emojis. Let's have a fantastic conversation!",
  "bob.browserNotSupportSpeechRecognitionMessage": "Your browser does not support speech recognition software! Try Chrome desktop, maybe?",
  "bob.firstMessage": "Hey there, how was it going ? ",
  "call.call": "Call Bob 📞 ",
  "call.hangUp": "Restart",
  "callHistory": "Call history",
  "callHistory.modal.title": "Call history",
  "callHistory.modal.noHistoryMessage": "You have no call history yet.",
  "conversation.idea": "Conversation ideas",
  "conversation.fitnessCoach.title": "Fitness Coach",
  "conversation.fitnessCoach.prompt": "I want you to act as a personal fitness coach. Things you can do on my request: create a workout plan for me, help on exercises, say why fitness is important, answer fitness questions. You can ask my fitness goal and what im looking to build.",
  "conversation.jobInterview.title": "Job Interview",
  "conversation.jobInterview.prompt": "I'll tell you the job position I'm searching for, and the working experience I have, let's do a job interviewe role-play to my skills for an upcoming job interview",
  "conversation.languagePractice.title": "Language Practice",
  "conversation.languagePractice.prompt": "Act as an language conversation tutor. You can come up with a topic and ask me questions for a friendly chat in {{language}} to help practice my {{language}}.",
  "conversation.knowledgeQuiz.title": "Pack n GO",
  "conversation.knowledgeQuiz.prompt": "You are an agent tasked with extracting information from me. I will answer your questions to help build a JSON response. Please only ask questions and I will provide the answers. If my response is unexpected or incorrect, please repeat the question until I give the correct information. Ask a total of 6 questions to fill in the JSON.\n\nHere are the questions to ask:\n\n1. What is your budget for this trip?\n2. What type of weather do you prefer?\n3. Which continents do you prefer to visit? (If none, leave blank)\n4. How many days are you planning to travel?\n5. What activities do you enjoy doing while traveling?\n6. Provide a short description of the trip in under 30 words.\n\nConsider the following variables to suggest cities:\n- Weather preference\n- Preferred continents\n- Budget\n- Duration of stay\n- Favorite activities\n\nThe JSON response should contain ${number_of_results} cities in the following format:\n\n```json\n{\n  \"cities\": [\n    {\n      \"city\": \"CityName\",\n      \"country_code\": \"ISO3166\",\n      \"cost_life\": \"Calculate daily dynamically\",\n      \"short_description\": \"Short description under 30 words\",\n      \"average_flight_cost\": \"Average one-way flight cost from source airport\",\n      \"hotel_stars\": \"three_star / four_star / five_star (based on user preferences)\",\n      \"top_3_act\": [\"Activity1\", \"Activity2\", \"Activity3\"],\n      \"user_prefers_sunny\": true/false,\n      \"user_prefers_snow\": true/false,\n      \"user_prefers_rain\": true/false\n    }\n  ]\n}\n```\n\nPlease ensure the following for each city:\n- `city`: City name\n- `country_code`: ISO 3166 country code\n- `cost_life`: Estimated daily cost based on living, vacation, food, entertainment, and daily expenses\n- `short_description`: Brief description of the city (under 30 words)\n- `average_flight_cost`: Average one-way flight cost from a source airport (departure date is today)\n- `hotel_stars`: Estimated hotel star rating based on user preferences\n- `top_3_act`: Top 3 activities in the city\n- `user_prefers_sunny`: User preference for sunny weather (true/false)\n- `user_prefers_snow`: User preference for snowy weather (true/false)\n- `user_prefers_rain`: User preference for rainy weather (true/false)\n\nThe only OUTPUT MUST be a JSON and nothing else.\n\n---\n\nThis reformatting clarifies the instructions and organizes the information for creating the JSON response."
}
